// 3. Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка)

    Console.WriteLine("Please write number");

int a = Convert.ToInt32(Console.ReadLine());

    if (a % 2 == 0)

System.Console.WriteLine("Number " + a + " is even");

    else System.Console.WriteLine("Number " + a + " is odd");